Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkTagAttributes.TagRotation Property
 The policy for the tag rotation.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkBase.SectionMarkTagAttributes.TagTextRotation TagRotation { get; set; }
Public Property TagRotation As SectionMarkBase.SectionMarkTagAttributes.TagTextRotation
	Get
	Set
Property Value
Type: SectionMarkBase.SectionMarkTagAttributes.TagTextRotation
See Also
Reference
SectionMarkBase.SectionMarkTagAttributes Class
Tekla.Structures.Drawing Namespace